#!/usr/bin/python
# -*- coding: utf-8 -*-

# 现代汉语常用字表
# http://baike.baidu.com/view/490908.htm

# ======================================== 常用字 ========================================

primary_chars_index = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23]

# 一画 （共2字）
primary_chars_1 = [
	u'一', u'乙',
]

# 二画 （共17字）
primary_chars_2 = [
	u'二', u'十', u'丁', u'厂', u'七', u'卜', u'人', u'入', u'八', u'九', u'几', u'儿', u'了', u'力', u'乃', u'刀', u'又',
]

# 三画 （共50字）
primary_chars_3 = [
	u'三', u'于', u'干', u'亏', u'士', u'工', u'土', u'才', u'寸', u'下', u'大', u'丈', u'与', u'万', u'上', u'小', u'口', u'巾', u'山', u'千',
	u'乞', u'川', u'亿', u'个', u'勺', u'久', u'凡', u'及', u'夕', u'丸', u'么', u'广', u'亡', u'门', u'义', u'之', u'尸', u'弓', u'己', u'已',
	u'子', u'卫', u'也', u'女', u'飞', u'刃', u'习', u'叉', u'马', u'乡',
]

# 四画 （共105字）
primary_chars_4 = [
	u'丰', u'王', u'井', u'开', u'夫', u'天', u'无', u'元', u'专', u'云', u'扎', u'艺', u'木', u'五', u'支', u'厅', u'不', u'太', u'犬', u'区', 
	u'历', u'尤', u'友', u'匹', u'车', u'巨', u'牙', u'屯', u'比', u'互', u'切', u'瓦', u'止', u'少', u'日', u'中', u'冈', u'贝', u'内', u'水', 
	u'见', u'午', u'牛', u'手', u'毛', u'气', u'升', u'长', u'仁', u'什', u'片', u'仆', u'化', u'仇', u'币', u'仍', u'仅', u'斤', u'爪', u'反', 
	u'介', u'父', u'从', u'今', u'凶', u'分', u'乏', u'公', u'仓', u'月', u'氏', u'勿', u'欠', u'风', u'丹', u'匀', u'乌', u'凤', u'勾', u'文', 
	u'六', u'方', u'火', u'为', u'斗', u'忆', u'订', u'计', u'户', u'认', u'心', u'尺', u'引', u'丑', u'巴', u'孔', u'队', u'办', u'以', u'允', 
	u'予', u'劝', u'双', u'书', u'幻', 
]

# 五画 （共137字）
primary_chars_5 = [
	u'玉', u'刊', u'示', u'末', u'未', u'击', u'打', u'巧', u'正', u'扑', u'扒', u'功', u'扔', u'去', u'甘', u'世', u'古', u'节', u'本', u'术', 
	u'汇', u'头', u'汉', u'宁', u'穴', u'它', u'讨', u'写', u'让', u'礼', u'训', u'必', u'议', u'讯', u'记', u'永', u'司', u'尼', u'民', u'出', 
	u'汁', u'丙', u'左', u'厉', u'右', u'石', u'布', u'龙', u'平', u'灭', u'轧', u'东', u'卡', u'北', u'占', u'业', u'旧', u'帅', u'归', u'且', 
	u'旦', u'目', u'叶', u'甲', u'申', u'叮', u'电', u'号', u'田', u'由', u'史', u'只', u'央', u'兄', u'叼', u'叫', u'另', u'叨', u'叹', u'四', 
	u'生', u'失', u'禾', u'丘', u'付', u'仗', u'代', u'仙', u'们', u'仪', u'白', u'仔', u'他', u'斥', u'瓜', u'乎', u'丛', u'令', u'用', u'甩', 
	u'印', u'乐', u'句', u'匆', u'册', u'犯', u'外', u'处', u'冬', u'鸟', u'务', u'包', u'饥', u'主', u'市', u'立', u'闪', u'兰', u'半', u'辽', 
	u'奶', u'奴', u'加', u'召', u'皮', u'边', u'发', u'孕', u'圣', u'对', u'台', u'矛', u'纠', u'母', u'幼', u'丝', u'可', 
]

# 六画 （共216字）
primary_chars_6 = [
	u'式', u'刑', u'动', u'扛', u'寺', u'吉', u'扣', u'考', u'托', u'老', u'执', u'巩', u'圾', u'扩', u'扫', u'地', u'扬', u'场', u'耳', u'共', 
	u'芒', u'亚', u'芝', u'朽', u'朴', u'机', u'权', u'过', u'臣', u'再', u'协', u'西', u'压', u'厌', u'在', u'有', u'百', u'存', u'而', u'页', 
	u'匠', u'夸', u'夺', u'灰', u'达', u'列', u'死', u'成', u'夹', u'轨', u'邪', u'划', u'迈', u'毕', u'至', u'此', u'贞', u'师', u'尘', u'尖', 
	u'劣', u'光', u'当', u'早', u'吐', u'吓', u'虫', u'曲', u'团', u'同', u'吊', u'吃', u'因', u'吸', u'吗', u'屿', u'帆', u'岁', u'回', u'岂', 
	u'刚', u'则', u'肉', u'网', u'年', u'朱', u'先', u'丢', u'舌', u'竹', u'迁', u'乔', u'伟', u'传', u'乒', u'乓', u'休', u'伍', u'伏', u'优', 
	u'伐', u'延', u'件', u'任', u'伤', u'价', u'份', u'华', u'仰', u'仿', u'伙', u'伪', u'自', u'血', u'向', u'似', u'后', u'行', u'舟', u'全', 
	u'会', u'杀', u'合', u'兆', u'企', u'众', u'爷', u'伞', u'创', u'肌', u'朵', u'杂', u'危', u'旬', u'旨', u'负', u'各', u'名', u'多', u'争', 
	u'色', u'壮', u'冲', u'冰', u'庄', u'庆', u'亦', u'刘', u'齐', u'交', u'次', u'衣', u'产', u'决', u'充', u'妄', u'闭', u'问', u'闯', u'羊', 
	u'并', u'关', u'米', u'灯', u'州', u'汗', u'污', u'江', u'池', u'汤', u'忙', u'兴', u'宇', u'守', u'宅', u'字', u'安', u'讲', u'军', u'许', 
	u'论', u'农', u'讽', u'设', u'访', u'寻', u'那', u'迅', u'尽', u'导', u'异', u'孙', u'阵', u'阳', u'收', u'阶', u'阴', u'防', u'奸', u'如', 
	u'妇', u'好', u'她', u'妈', u'戏', u'羽', u'观', u'欢', u'买', u'红', u'纤', u'级', u'约', u'纪', u'驰', u'巡', 
]

# 七画 （共264字）
primary_chars_7 = [
	u'寿', u'弄', u'麦', u'形', u'进', u'戒', u'吞', u'远', u'违', u'运', u'扶', u'抚', u'坛', u'技', u'坏', u'扰', u'拒', u'找', u'批', u'扯', 
	u'址', u'走', u'抄', u'坝', u'贡', u'攻', u'赤', u'折', u'抓', u'扮', u'抢', u'孝', u'均', u'抛', u'投', u'坟', u'抗', u'坑', u'坊', u'抖', 
	u'护', u'壳', u'志', u'扭', u'块', u'声', u'把', u'报', u'却', u'劫', u'芽', u'花', u'芹', u'芬', u'苍', u'芳', u'严', u'芦', u'劳', u'克', 
	u'苏', u'杆', u'杠', u'杜', u'材', u'村', u'杏', u'极', u'李', u'杨', u'求', u'更', u'束', u'豆', u'两', u'丽', u'医', u'辰', u'励', u'否', 
	u'还', u'歼', u'来', u'连', u'步', u'坚', u'旱', u'盯', u'呈', u'时', u'吴', u'助', u'县', u'里', u'呆', u'园', u'旷', u'围', u'呀', u'吨', 
	u'足', u'邮', u'男', u'困', u'吵', u'串', u'员', u'听', u'吩', u'吹', u'呜', u'吧', u'吼', u'别', u'岗', u'帐', u'财', u'针', u'钉', u'告', 
	u'我', u'乱', u'利', u'秃', u'秀', u'私', u'每', u'兵', u'估', u'体', u'何', u'但', u'伸', u'作', u'伯', u'伶', u'佣', u'低', u'你', u'住', 
	u'位', u'伴', u'身', u'皂', u'佛', u'近', u'彻', u'役', u'返', u'余', u'希', u'坐', u'谷', u'妥', u'含', u'邻', u'岔', u'肝', u'肚', u'肠', 
	u'龟', u'免', u'狂', u'犹', u'角', u'删', u'条', u'卵', u'岛', u'迎', u'饭', u'饮', u'系', u'言', u'冻', u'状', u'亩', u'况', u'床', u'库', 
	u'疗', u'应', u'冷', u'这', u'序', u'辛', u'弃', u'冶', u'忘', u'闲', u'间', u'闷', u'判', u'灶', u'灿', u'弟', u'汪', u'沙', u'汽', u'沃', 
	u'泛', u'沟', u'没', u'沈', u'沉', u'怀', u'忧', u'快', u'完', u'宋', u'宏', u'牢', u'究', u'穷', u'灾', u'良', u'证', u'启', u'评', u'补', 
	u'初', u'社', u'识', u'诉', u'诊', u'词', u'译', u'君', u'灵', u'即', u'层', u'尿', u'尾', u'迟', u'局', u'改', u'张', u'忌', u'际', u'陆', 
	u'阿', u'陈', u'阻', u'附', u'妙', u'妖', u'妨', u'努', u'忍', u'劲', u'鸡', u'驱', u'纯', u'纱', u'纳', u'纲', u'驳', u'纵', u'纷', u'纸', 
	u'纹', u'纺', u'驴', u'纽', 
]

# 八画 （共310字）
primary_chars_8 = [
	u'奉', u'玩', u'环', u'武', u'青', u'责', u'现', u'表', u'规', u'抹', u'拢', u'拔', u'拣', u'担', u'坦', u'押', u'抽', u'拐', u'拖', u'拍', 
	u'者', u'顶', u'拆', u'拥', u'抵', u'拘', u'势', u'抱', u'垃', u'拉', u'拦', u'拌', u'幸', u'招', u'坡', u'披', u'拨', u'择', u'抬', u'其', 
	u'取', u'苦', u'若', u'茂', u'苹', u'苗', u'英', u'范', u'直', u'茄', u'茎', u'茅', u'林', u'枝', u'杯', u'柜', u'析', u'板', u'松', u'枪', 
	u'构', u'杰', u'述', u'枕', u'丧', u'或', u'画', u'卧', u'事', u'刺', u'枣', u'雨', u'卖', u'矿', u'码', u'厕', u'奔', u'奇', u'奋', u'态', 
	u'欧', u'垄', u'妻', u'轰', u'顷', u'转', u'斩', u'轮', u'软', u'到', u'非', u'叔', u'肯', u'齿', u'些', u'虎', u'虏', u'肾', u'贤', u'尚', 
	u'旺', u'具', u'果', u'味', u'昆', u'国', u'昌', u'畅', u'明', u'易', u'昂', u'典', u'固', u'忠', u'咐', u'呼', u'鸣', u'咏', u'呢', u'岸', 
	u'岩', u'帖', u'罗', u'帜', u'岭', u'凯', u'败', u'贩', u'购', u'图', u'钓', u'制', u'知', u'垂', u'牧', u'物', u'乖', u'刮', u'秆', u'和', 
	u'季', u'委', u'佳', u'侍', u'供', u'使', u'例', u'版', u'侄', u'侦', u'侧', u'凭', u'侨', u'佩', u'货', u'依', u'的', u'迫', u'质', u'欣', 
	u'征', u'往', u'爬', u'彼', u'径', u'所', u'舍', u'金', u'命', u'斧', u'爸', u'采', u'受', u'乳', u'贪', u'念', u'贫', u'肤', u'肺', u'肢', 
	u'肿', u'胀', u'朋', u'股', u'肥', u'服', u'胁', u'周', u'昏', u'鱼', u'兔', u'狐', u'忽', u'狗', u'备', u'饰', u'饱', u'饲', u'变', u'京', 
	u'享', u'店', u'夜', u'庙', u'府', u'底', u'剂', u'郊', u'废', u'净', u'盲', u'放', u'刻', u'育', u'闸', u'闹', u'郑', u'券', u'卷', u'单', 
	u'炒', u'炊', u'炕', u'炎', u'炉', u'沫', u'浅', u'法', u'泄', u'河', u'沾', u'泪', u'油', u'泊', u'沿', u'泡', u'注', u'泻', u'泳', u'泥', 
	u'沸', u'波', u'泼', u'泽', u'治', u'怖', u'性', u'怕', u'怜', u'怪', u'学', u'宝', u'宗', u'定', u'宜', u'审', u'宙', u'官', u'空', u'帘', 
	u'实', u'试', u'郎', u'诗', u'肩', u'房', u'诚', u'衬', u'衫', u'视', u'话', u'诞', u'询', u'该', u'详', u'建', u'肃', u'录', u'隶', u'居', 
	u'届', u'刷', u'屈', u'弦', u'承', u'孟', u'孤', u'陕', u'降', u'限', u'妹', u'姑', u'姐', u'姓', u'始', u'驾', u'参', u'艰', u'线', u'练', 
	u'组', u'细', u'驶', u'织', u'终', u'驻', u'驼', u'绍', u'经', u'贯', 
]

# 九画 （共316字）
primary_chars_9 = [
	u'奏', u'春', u'帮', u'珍', u'玻', u'毒', u'型', u'挂', u'封', u'持', u'项', u'垮', u'挎', u'城', u'挠', u'政', u'赴', u'赵', u'挡', u'挺', 
	u'括', u'拴', u'拾', u'挑', u'指', u'垫', u'挣', u'挤', u'拼', u'挖', u'按', u'挥', u'挪', u'某', u'甚', u'革', u'荐', u'巷', u'带', u'草', 
	u'茧', u'茶', u'荒', u'茫', u'荡', u'荣', u'故', u'胡', u'南', u'药', u'标', u'枯', u'柄', u'栋', u'相', u'查', u'柏', u'柳', u'柱', u'柿', 
	u'栏', u'树', u'要', u'咸', u'威', u'歪', u'研', u'砖', u'厘', u'厚', u'砌', u'砍', u'面', u'耐', u'耍', u'牵', u'残', u'殃', u'轻', u'鸦', 
	u'皆', u'背', u'战', u'点', u'临', u'览', u'竖', u'省', u'削', u'尝', u'是', u'盼', u'眨', u'哄', u'显', u'哑', u'冒', u'映', u'星', u'昨', 
	u'畏', u'趴', u'胃', u'贵', u'界', u'虹', u'虾', u'蚁', u'思', u'蚂', u'虽', u'品', u'咽', u'骂', u'哗', u'咱', u'响', u'哈', u'咬', u'咳', 
	u'哪', u'炭', u'峡', u'罚', u'贱', u'贴', u'骨', u'钞', u'钟', u'钢', u'钥', u'钩', u'卸', u'缸', u'拜', u'看', u'矩', u'怎', u'牲', u'选', 
	u'适', u'秒', u'香', u'种', u'秋', u'科', u'重', u'复', u'竿', u'段', u'便', u'俩', u'贷', u'顺', u'修', u'保', u'促', u'侮', u'俭', u'俗', 
	u'俘', u'信', u'皇', u'泉', u'鬼', u'侵', u'追', u'俊', u'盾', u'待', u'律', u'很', u'须', u'叙', u'剑', u'逃', u'食', u'盆', u'胆', u'胜', 
	u'胞', u'胖', u'脉', u'勉', u'狭', u'狮', u'独', u'狡', u'狱', u'狠', u'贸', u'怨', u'急', u'饶', u'蚀', u'饺', u'饼', u'弯', u'将', u'奖', 
	u'哀', u'亭', u'亮', u'度', u'迹', u'庭', u'疮', u'疯', u'疫', u'疤', u'姿', u'亲', u'音', u'帝', u'施', u'闻', u'阀', u'阁', u'差', u'养', 
	u'美', u'姜', u'叛', u'送', u'类', u'迷', u'前', u'首', u'逆', u'总', u'炼', u'炸', u'炮', u'烂', u'剃', u'洁', u'洪', u'洒', u'浇', u'浊', 
	u'洞', u'测', u'洗', u'活', u'派', u'洽', u'染', u'济', u'洋', u'洲', u'浑', u'浓', u'津', u'恒', u'恢', u'恰', u'恼', u'恨', u'举', u'觉', 
	u'宣', u'室', u'宫', u'宪', u'突', u'穿', u'窃', u'客', u'冠', u'语', u'扁', u'袄', u'祖', u'神', u'祝', u'误', u'诱', u'说', u'诵', u'垦', 
	u'退', u'既', u'屋', u'昼', u'费', u'陡', u'眉', u'孩', u'除', u'险', u'院', u'娃', u'姥', u'姨', u'姻', u'娇', u'怒', u'架', u'贺', u'盈', 
	u'勇', u'怠', u'柔', u'垒', u'绑', u'绒', u'结', u'绕', u'骄', u'绘', u'给', u'络', u'骆', u'绝', u'绞', u'统', 
]

# 十画 （共284字）
primary_chars_10 = [
	u'耕', u'耗', u'艳', u'泰', u'珠', u'班', u'素', u'蚕', u'顽', u'盏', u'匪', u'捞', u'栽', u'捕', u'振', u'载', u'赶', u'起', u'盐', u'捎', 
	u'捏', u'埋', u'捉', u'捆', u'捐', u'损', u'都', u'哲', u'逝', u'捡', u'换', u'挽', u'热', u'恐', u'壶', u'挨', u'耻', u'耽', u'恭', u'莲', 
	u'莫', u'荷', u'获', u'晋', u'恶', u'真', u'框', u'桂', u'档', u'桐', u'株', u'桥', u'桃', u'格', u'校', u'核', u'样', u'根', u'索', u'哥', 
	u'速', u'逗', u'栗', u'配', u'翅', u'辱', u'唇', u'夏', u'础', u'破', u'原', u'套', u'逐', u'烈', u'殊', u'顾', u'轿', u'较', u'顿', u'毙', 
	u'致', u'柴', u'桌', u'虑', u'监', u'紧', u'党', u'晒', u'眠', u'晓', u'鸭', u'晃', u'晌', u'晕', u'蚊', u'哨', u'哭', u'恩', u'唤', u'啊', 
	u'唉', u'罢', u'峰', u'圆', u'贼', u'贿', u'钱', u'钳', u'钻', u'铁', u'铃', u'铅', u'缺', u'氧', u'特', u'牺', u'造', u'乘', u'敌', u'秤', 
	u'租', u'积', u'秧', u'秩', u'称', u'秘', u'透', u'笔', u'笑', u'笋', u'债', u'借', u'值', u'倚', u'倾', u'倒', u'倘', u'俱', u'倡', u'候', 
	u'俯', u'倍', u'倦', u'健', u'臭', u'射', u'躬', u'息', u'徒', u'徐', u'舰', u'舱', u'般', u'航', u'途', u'拿', u'爹', u'爱', u'颂', u'翁', 
	u'脆', u'脂', u'胸', u'胳', u'脏', u'胶', u'脑', u'狸', u'狼', u'逢', u'留', u'皱', u'饿', u'恋', u'桨', u'浆', u'衰', u'高', u'席', u'准', 
	u'座', u'脊', u'症', u'病', u'疾', u'疼', u'疲', u'效', u'离', u'唐', u'资', u'凉', u'站', u'剖', u'竞', u'部', u'旁', u'旅', u'畜', u'阅', 
	u'羞', u'瓶', u'拳', u'粉', u'料', u'益', u'兼', u'烤', u'烘', u'烦', u'烧', u'烛', u'烟', u'递', u'涛', u'浙', u'涝', u'酒', u'涉', u'消', 
	u'浩', u'海', u'涂', u'浴', u'浮', u'流', u'润', u'浪', u'浸', u'涨', u'烫', u'涌', u'悟', u'悄', u'悔', u'悦', u'害', u'宽', u'家', u'宵', 
	u'宴', u'宾', u'窄', u'容', u'宰', u'案', u'请', u'朗', u'诸', u'读', u'扇', u'袜', u'袖', u'袍', u'被', u'祥', u'课', u'谁', u'调', u'冤', 
	u'谅', u'谈', u'谊', u'剥', u'恳', u'展', u'剧', u'屑', u'弱', u'陵', u'陶', u'陷', u'陪', u'娱', u'娘', u'通', u'能', u'难', u'预', u'桑', 
	u'绢', u'绣', u'验', u'继', 
]

# 十一画 （共209字）
primary_chars_11 = [
	u'球', u'理', u'捧', u'堵', u'描', u'域', u'掩', u'捷', u'排', u'掉', u'堆', u'推', u'掀', u'授', u'教', u'掏', u'掠', u'培', u'接', u'控', 
	u'探', u'据', u'掘', u'职', u'基', u'著', u'勒', u'黄', u'萌', u'萝', u'菌', u'菜', u'萄', u'菊', u'萍', u'菠', u'营', u'械', u'梦', u'梢', 
	u'梅', u'检', u'梳', u'梯', u'桶', u'救', u'副', u'票', u'戚', u'爽', u'聋', u'袭', u'盛', u'雪', u'辅', u'辆', u'虚', u'雀', u'堂', u'常', 
	u'匙', u'晨', u'睁', u'眯', u'眼', u'悬', u'野', u'啦', u'晚', u'啄', u'距', u'跃', u'略', u'蛇', u'累', u'唱', u'患', u'唯', u'崖', u'崭', 
	u'崇', u'圈', u'铜', u'铲', u'银', u'甜', u'梨', u'犁', u'移', u'笨', u'笼', u'笛', u'符', u'第', u'敏', u'做', u'袋', u'悠', u'偿', u'偶', 
	u'偷', u'您', u'售', u'停', u'偏', u'假', u'得', u'衔', u'盘', u'船', u'斜', u'盒', u'鸽', u'悉', u'欲', u'彩', u'领', u'脚', u'脖', u'脸', 
	u'脱', u'象', u'够', u'猜', u'猪', u'猎', u'猫', u'猛', u'馅', u'馆', u'凑', u'减', u'毫', u'麻', u'痒', u'痕', u'廊', u'康', u'庸', u'鹿', 
	u'盗', u'章', u'竟', u'商', u'族', u'旋', u'望', u'率', u'着', u'盖', u'粘', u'粗', u'粒', u'断', u'剪', u'兽', u'清', u'添', u'淋', u'淹', 
	u'渠', u'渐', u'混', u'渔', u'淘', u'液', u'淡', u'深', u'婆', u'梁', u'渗', u'情', u'惜', u'惭', u'悼', u'惧', u'惕', u'惊', u'惨', u'惯', 
	u'寇', u'寄', u'宿', u'窑', u'密', u'谋', u'谎', u'祸', u'谜', u'逮', u'敢', u'屠', u'弹', u'随', u'蛋', u'隆', u'隐', u'婚', u'婶', u'颈', 
	u'绩', u'绪', u'续', u'骑', u'绳', u'维', u'绵', u'绸', u'绿', 
]

# 十二画 （共214字）
primary_chars_12 = [
	u'琴', u'斑', u'替', u'款', u'堪', u'搭', u'塔', u'越', u'趁', u'趋', u'超', u'提', u'堤', u'博', u'揭', u'喜', u'插', u'揪', u'搜', u'煮', 
	u'援', u'裁', u'搁', u'搂', u'搅', u'握', u'揉', u'斯', u'期', u'欺', u'联', u'散', u'惹', u'葬', u'葛', u'董', u'葡', u'敬', u'葱', u'落', 
	u'朝', u'辜', u'葵', u'棒', u'棋', u'植', u'森', u'椅', u'椒', u'棵', u'棍', u'棉', u'棚', u'棕', u'惠', u'惑', u'逼', u'厨', u'厦', u'硬', 
	u'确', u'雁', u'殖', u'裂', u'雄', u'暂', u'雅', u'辈', u'悲', u'紫', u'辉', u'敞', u'赏', u'掌', u'晴', u'暑', u'最', u'量', u'喷', u'晶', 
	u'喇', u'遇', u'喊', u'景', u'践', u'跌', u'跑', u'遗', u'蛙', u'蛛', u'蜓', u'喝', u'喂', u'喘', u'喉', u'幅', u'帽', u'赌', u'赔', u'黑', 
	u'铸', u'铺', u'链', u'销', u'锁', u'锄', u'锅', u'锈', u'锋', u'锐', u'短', u'智', u'毯', u'鹅', u'剩', u'稍', u'程', u'稀', u'税', u'筐', 
	u'等', u'筑', u'策', u'筛', u'筒', u'答', u'筋', u'筝', u'傲', u'傅', u'牌', u'堡', u'集', u'焦', u'傍', u'储', u'奥', u'街', u'惩', u'御', 
	u'循', u'艇', u'舒', u'番', u'释', u'禽', u'腊', u'脾', u'腔', u'鲁', u'猾', u'猴', u'然', u'馋', u'装', u'蛮', u'就', u'痛', u'童', u'阔', 
	u'善', u'羡', u'普', u'粪', u'尊', u'道', u'曾', u'焰', u'港', u'湖', u'渣', u'湿', u'温', u'渴', u'滑', u'湾', u'渡', u'游', u'滋', u'溉', 
	u'愤', u'慌', u'惰', u'愧', u'愉', u'慨', u'割', u'寒', u'富', u'窜', u'窝', u'窗', u'遍', u'裕', u'裤', u'裙', u'谢', u'谣', u'谦', u'属', 
	u'屡', u'强', u'粥', u'疏', u'隔', u'隙', u'絮', u'嫂', u'登', u'缎', u'缓', u'编', u'骗', u'缘',
]

# 十三画 （共143字）
primary_chars_13 = [
	u'瑞', u'魂', u'肆', u'摄', u'摸', u'填', u'搏', u'塌', u'鼓', u'摆', u'携', u'搬', u'摇', u'搞', u'塘', u'摊', u'蒜', u'勤', u'鹊', u'蓝', 
	u'墓', u'幕', u'蓬', u'蓄', u'蒙', u'蒸', u'献', u'禁', u'楚', u'想', u'槐', u'榆', u'楼', u'概', u'赖', u'酬', u'感', u'碍', u'碑', u'碎', 
	u'碰', u'碗', u'碌', u'雷', u'零', u'雾', u'雹', u'输', u'督', u'龄', u'鉴', u'睛', u'睡', u'睬', u'鄙', u'愚', u'暖', u'盟', u'歇', u'暗', 
	u'照', u'跨', u'跳', u'跪', u'路', u'跟', u'遣', u'蛾', u'蜂', u'嗓', u'置', u'罪', u'罩', u'错', u'锡', u'锣', u'锤', u'锦', u'键', u'锯', 
	u'矮', u'辞', u'稠', u'愁', u'筹', u'签', u'简', u'毁', u'舅', u'鼠', u'催', u'傻', u'像', u'躲', u'微', u'愈', u'遥', u'腰', u'腥', u'腹', 
	u'腾', u'腿', u'触', u'解', u'酱', u'痰', u'廉', u'新', u'韵', u'意', u'粮', u'数', u'煎', u'塑', u'慈', u'煤', u'煌', u'满', u'漠', u'源', 
	u'滤', u'滥', u'滔', u'溪', u'溜', u'滚', u'滨', u'粱', u'滩', u'慎', u'誉', u'塞', u'谨', u'福', u'群', u'殿', u'辟', u'障', u'嫌', u'嫁', 
	u'叠', u'缝', u'缠', 
]

# 十四画 （共88字）
primary_chars_14 = [
	u'静', u'碧', u'璃', u'墙', u'撇', u'嘉', u'摧', u'截', u'誓', u'境', u'摘', u'摔', u'聚', u'蔽', u'慕', u'暮', u'蔑', u'模', u'榴', u'榜', 
	u'榨', u'歌', u'遭', u'酷', u'酿', u'酸', u'磁', u'愿', u'需', u'弊', u'裳', u'颗', u'嗽', u'蜻', u'蜡', u'蝇', u'蜘', u'赚', u'锹', u'锻', 
	u'舞', u'稳', u'算', u'箩', u'管', u'僚', u'鼻', u'魄', u'貌', u'膜', u'膊', u'膀', u'鲜', u'疑', u'馒', u'裹', u'敲', u'豪', u'膏', u'遮', 
	u'腐', u'瘦', u'辣', u'竭', u'端', u'旗', u'精', u'歉', u'熄', u'熔', u'漆', u'漂', u'漫', u'滴', u'演', u'漏', u'慢', u'寨', u'赛', u'察', 
	u'蜜', u'谱', u'嫩', u'翠', u'熊', u'凳', u'骡', u'缩', 
]

# 十五画 （共64字）
primary_chars_15 = [
	u'慧', u'撕', u'撒', u'趣', u'趟', u'撑', u'播', u'撞', u'撤', u'增', u'聪', u'鞋', u'蕉', u'蔬', u'横', u'槽', u'樱', u'橡', u'飘', u'醋', 
	u'醉', u'震', u'霉', u'瞒', u'题', u'暴', u'瞎', u'影', u'踢', u'踏', u'踩', u'踪', u'蝶', u'蝴', u'嘱', u'墨', u'镇', u'靠', u'稻', u'黎', 
	u'稿', u'稼', u'箱', u'箭', u'篇', u'僵', u'躺', u'僻', u'德', u'艘', u'膝', u'膛', u'熟', u'摩', u'颜', u'毅', u'糊', u'遵', u'潜', u'潮', 
	u'懂', u'额', u'慰', u'劈', 
]

# 十六画 （共36字）
primary_chars_16 = [
	u'操', u'燕', u'薯', u'薪', u'薄', u'颠', u'橘', u'整', u'融', u'醒', u'餐', u'嘴', u'蹄', u'器', u'赠', u'默', u'镜', u'赞', u'篮', u'邀', 
	u'衡', u'膨', u'雕', u'磨', u'凝', u'辨', u'辩', u'糖', u'糕', u'燃', u'澡', u'激', u'懒', u'壁', u'避', u'缴', 
]

# 十七画 （共19字）
primary_chars_17 = [
	u'戴', u'擦', u'鞠', u'藏', u'霜', u'霞', u'瞧', u'蹈', u'螺', u'穗', u'繁', u'辫', u'赢', u'糟', u'糠', u'燥', u'臂', u'翼', u'骤', 
]

# 十八画 （共6字）
primary_chars_18 = [
	u'鞭', u'覆', u'蹦', u'镰', u'翻', u'鹰', 
]

# 十九画 （共7字）
primary_chars_19 = [
	u'警', u'攀', u'蹲', u'颤', u'瓣', u'爆', u'疆', 
]

# 二十画 （共8字）
primary_chars_20 = [
	u'壤', u'耀', u'躁', u'嚼', u'嚷', u'籍', u'魔', u'灌', 
]

# 二十一画 （共3字）
primary_chars_21 = [
	u'蠢', u'霸', u'露',
]

# 二十二画 （共1字）
primary_chars_22 = [
	u'囊',
]

# 二十三画 （共1字）
primary_chars_23 = [
	u'罐',
]




# ======================================== 次常用字 ========================================

secondary_chars_index = [2, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 24]

# 二画 （共2字）
secondary_chars_2 = [
	u'匕', u'刁',
]

# 四画 （共8字）
secondary_chars_4 = [
	u'丐', u'歹', u'戈', u'夭', u'仑', u'讥', u'冗', u'邓', 
]

# 五画 （共14字）
secondary_chars_5 = [
	u'艾', u'夯', u'凸', u'卢', u'叭', u'叽', u'皿', u'凹', u'囚', u'矢', u'乍', u'尔', u'冯', u'玄',
]

# 六画 （共34字）
secondary_chars_6 = [
	u'邦', u'迂', u'邢', u'芋', u'芍', u'吏', u'夷', u'吁', u'吕', u'吆', u'屹', u'廷', u'迄', u'臼', u'仲', u'伦', u'伊', u'肋', u'旭', u'匈', 
	u'凫', u'妆', u'亥', u'汛', u'讳', u'讶', u'讹', u'讼', u'诀', u'弛', u'阱', u'驮', u'驯', u'纫', 
]

# 七画 （共77字）
secondary_chars_7 = [
	u'玖', u'玛', u'韧', u'抠', u'扼', u'汞', u'扳', u'抡', u'坎', u'坞', u'抑', u'拟', u'抒', u'芙', u'芜', u'苇', u'芥', u'芯', u'芭', u'杖', 
	u'杉', u'巫', u'杈', u'甫', u'匣', u'轩', u'卤', u'肖', u'吱', u'吠', u'呕', u'呐', u'吟', u'呛', u'吻', u'吭', u'邑', u'囤', u'吮', u'岖', 
	u'牡', u'佑', u'佃', u'伺', u'囱', u'肛', u'肘', u'甸', u'狈', u'鸠', u'彤', u'灸', u'刨', u'庇', u'吝', u'庐', u'闰', u'兑', u'灼', u'沐', 
	u'沛', u'汰', u'沥', u'沦', u'汹', u'沧', u'沪', u'忱', u'诅', u'诈', u'罕', u'屁', u'坠', u'妓', u'姊', u'妒', u'纬', 
]

# 八画 （共97字）
secondary_chars_8 = [
	u'玫', u'卦', u'坷', u'坯', u'拓', u'坪', u'坤', u'拄', u'拧', u'拂', u'拙', u'拇', u'拗', u'茉', u'昔', u'苛', u'苫', u'苟', u'苞', u'茁', 
	u'苔', u'枉', u'枢', u'枚', u'枫', u'杭', u'郁', u'矾', u'奈', u'奄', u'殴', u'歧', u'卓', u'昙', u'哎', u'咕', u'呵', u'咙', u'呻', u'咒', 
	u'咆', u'咖', u'帕', u'账', u'贬', u'贮', u'氛', u'秉', u'岳', u'侠', u'侥', u'侣', u'侈', u'卑', u'刽', u'刹', u'肴', u'觅', u'忿', u'瓮', 
	u'肮', u'肪', u'狞', u'庞', u'疟', u'疙', u'疚', u'卒', u'氓', u'炬', u'沽', u'沮', u'泣', u'泞', u'泌', u'沼', u'怔', u'怯', u'宠', u'宛', 
	u'衩', u'祈', u'诡', u'帚', u'屉', u'弧', u'弥', u'陋', u'陌', u'函', u'姆', u'虱', u'叁', u'绅', u'驹', u'绊', u'绎', 
]

# 九画 （共99字）
secondary_chars_9 = [
	u'契', u'贰', u'玷', u'玲', u'珊', u'拭', u'拷', u'拱', u'挟', u'垢', u'垛', u'拯', u'荆', u'茸', u'茬', u'荚', u'茵', u'茴', u'荞', u'荠', 
	u'荤', u'荧', u'荔', u'栈', u'柑', u'栅', u'柠', u'枷', u'勃', u'柬', u'砂', u'泵', u'砚', u'鸥', u'轴', u'韭', u'虐', u'昧', u'盹', u'咧', 
	u'昵', u'昭', u'盅', u'勋', u'哆', u'咪', u'哟', u'幽', u'钙', u'钝', u'钠', u'钦', u'钧', u'钮', u'毡', u'氢', u'秕', u'俏', u'俄', u'俐', 
	u'侯', u'徊', u'衍', u'胚', u'胧', u'胎', u'狰', u'饵', u'峦', u'奕', u'咨', u'飒', u'闺', u'闽', u'籽', u'娄', u'烁', u'炫', u'洼', u'柒', 
	u'涎', u'洛', u'恃', u'恍', u'恬', u'恤', u'宦', u'诫', u'诬', u'祠', u'诲', u'屏', u'屎', u'逊', u'陨', u'姚', u'娜', u'蚤', u'骇', 
]

# 十画 （共107字）
secondary_chars_10 = [
	u'耘', u'耙', u'秦', u'匿', u'埂', u'捂', u'捍', u'袁', u'捌', u'挫', u'挚', u'捣', u'捅', u'埃', u'耿', u'聂', u'荸', u'莽', u'莱', u'莉', 
	u'莹', u'莺', u'梆', u'栖', u'桦', u'栓', u'桅', u'桩', u'贾', u'酌', u'砸', u'砰', u'砾', u'殉', u'逞', u'哮', u'唠', u'哺', u'剔', u'蚌', 
	u'蚜', u'畔', u'蚣', u'蚪', u'蚓', u'哩', u'圃', u'鸯', u'唁', u'哼', u'唆', u'峭', u'唧', u'峻', u'赂', u'赃', u'钾', u'铆', u'氨', u'秫', 
	u'笆', u'俺', u'赁', u'倔', u'殷', u'耸', u'舀', u'豺', u'豹', u'颁', u'胯', u'胰', u'脐', u'脓', u'逛', u'卿', u'鸵', u'鸳', u'馁', u'凌', 
	u'凄', u'衷', u'郭', u'斋', u'疹', u'紊', u'瓷', u'羔', u'烙', u'浦', u'涡', u'涣', u'涤', u'涧', u'涕', u'涩', u'悍', u'悯', u'窍', u'诺', 
	u'诽', u'袒', u'谆', u'祟', u'恕', u'娩', u'骏', 
]

# 十一画 （共142字）
secondary_chars_11 = [
	u'琐', u'麸', u'琉', u'琅', u'措', u'捺', u'捶', u'赦', u'埠', u'捻', u'掐', u'掂', u'掖', u'掷', u'掸', u'掺', u'勘', u'聊', u'娶', u'菱', 
	u'菲', u'萎', u'菩', u'萤', u'乾', u'萧', u'萨', u'菇', u'彬', u'梗', u'梧', u'梭', u'曹', u'酝', u'酗', u'厢', u'硅', u'硕', u'奢', u'盔', 
	u'匾', u'颅', u'彪', u'眶', u'晤', u'曼', u'晦', u'冕', u'啡', u'畦', u'趾', u'啃', u'蛆', u'蚯', u'蛉', u'蛀', u'唬', u'啰', u'唾', u'啤', 
	u'啥', u'啸', u'崎', u'逻', u'崔', u'崩', u'婴', u'赊', u'铐', u'铛', u'铝', u'铡', u'铣', u'铭', u'矫', u'秸', u'秽', u'笙', u'笤', u'偎', 
	u'傀', u'躯', u'兜', u'衅', u'徘', u'徙', u'舶', u'舷', u'舵', u'敛', u'翎', u'脯', u'逸', u'凰', u'猖', u'祭', u'烹', u'庶', u'庵', u'痊', 
	u'阎', u'阐', u'眷', u'焊', u'焕', u'鸿', u'涯', u'淑', u'淌', u'淮', u'淆', u'渊', u'淫', u'淳', u'淤', u'淀', u'涮', u'涵', u'惦', u'悴', 
	u'惋', u'寂', u'窒', u'谍', u'谐', u'裆', u'袱', u'祷', u'谒', u'谓', u'谚', u'尉', u'堕', u'隅', u'婉', u'颇', u'绰', u'绷', u'综', u'绽', 
	u'缀', u'巢', 
]

# 十二画 （共106字）
secondary_chars_12 = [
	u'琳', u'琢', u'琼', u'揍', u'堰', u'揩', u'揽', u'揖', u'彭', u'揣', u'搀', u'搓', u'壹', u'搔', u'葫', u'募', u'蒋', u'蒂', u'韩', u'棱', 
	u'椰', u'焚', u'椎', u'棺', u'榔', u'椭', u'粟', u'棘', u'酣', u'酥', u'硝', u'硫', u'颊', u'雳', u'翘', u'凿', u'棠', u'晰', u'鼎', u'喳', 
	u'遏', u'晾', u'畴', u'跋', u'跛', u'蛔', u'蜒', u'蛤', u'鹃', u'喻', u'啼', u'喧', u'嵌', u'赋', u'赎', u'赐', u'锉', u'锌', u'甥', u'掰', 
	u'氮', u'氯', u'黍', u'筏', u'牍', u'粤', u'逾', u'腌', u'腋', u'腕', u'猩', u'猬', u'惫', u'敦', u'痘', u'痢', u'痪', u'竣', u'翔', u'奠', 
	u'遂', u'焙', u'滞', u'湘', u'渤', u'渺', u'溃', u'溅', u'湃', u'愕', u'惶', u'寓', u'窖', u'窘', u'雇', u'谤', u'犀', u'隘', u'媒', u'媚', 
	u'婿', u'缅', u'缆', u'缔', u'缕', u'骚', 
]

# 十三画 （共89字）
secondary_chars_13 = [
	u'瑟', u'鹉', u'瑰', u'搪', u'聘', u'斟', u'靴', u'靶', u'蓖', u'蒿', u'蒲', u'蓉', u'楔', u'椿', u'楷', u'榄', u'楞', u'楣', u'酪', u'碘', 
	u'硼', u'碉', u'辐', u'辑', u'频', u'睹', u'睦', u'瞄', u'嗜', u'嗦', u'暇', u'畸', u'跷', u'跺', u'蜈', u'蜗', u'蜕', u'蛹', u'嗅', u'嗡', 
	u'嗤', u'署', u'蜀', u'幌', u'锚', u'锥', u'锨', u'锭', u'锰', u'稚', u'颓', u'筷', u'魁', u'衙', u'腻', u'腮', u'腺', u'鹏', u'肄', u'猿', 
	u'颖', u'煞', u'雏', u'馍', u'馏', u'禀', u'痹', u'廓', u'痴', u'靖', u'誊', u'漓', u'溢', u'溯', u'溶', u'滓', u'溺', u'寞', u'窥', u'窟', 
	u'寝', u'褂', u'裸', u'谬', u'媳', u'嫉', u'缚', u'缤', u'剿', 
]

# 十四画 （共52字）
secondary_chars_14 = [
	u'赘', u'熬', u'赫', u'蔫', u'摹', u'蔓', u'蔗', u'蔼', u'熙', u'蔚', u'兢', u'榛', u'榕', u'酵', u'碟', u'碴', u'碱', u'碳', u'辕', u'辖', 
	u'雌', u'墅', u'嘁', u'踊', u'蝉', u'嘀', u'幔', u'镀', u'舔', u'熏', u'箍', u'箕', u'箫', u'舆', u'僧', u'孵', u'瘩', u'瘟', u'彰', u'粹', 
	u'漱', u'漩', u'漾', u'慷', u'寡', u'寥', u'谭', u'褐', u'褪', u'隧', u'嫡', u'缨', 
]

# 十五画 （共62字）
secondary_chars_15 = [
	u'撵', u'撩', u'撮', u'撬', u'擒', u'墩', u'撰', u'鞍', u'蕊', u'蕴', u'樊', u'樟', u'橄', u'敷', u'豌', u'醇', u'磕', u'磅', u'碾', u'憋', 
	u'嘶', u'嘲', u'嘹', u'蝠', u'蝎', u'蝌', u'蝗', u'蝙', u'嘿', u'幢', u'镊', u'镐', u'稽', u'篓', u'膘', u'鲤', u'鲫', u'褒', u'瘪', u'瘤', 
	u'瘫', u'凛', u'澎', u'潭', u'潦', u'澳', u'潘', u'澈', u'澜', u'澄', u'憔', u'懊', u'憎', u'翩', u'褥', u'谴', u'鹤', u'憨', u'履', u'嬉', 
	u'豫', u'缭', 
]

# 十六画 （共42字）
secondary_chars_16 = [
	u'撼', u'擂', u'擅', u'蕾', u'薛', u'薇', u'擎', u'翰', u'噩', u'橱', u'橙', u'瓢', u'磺', u'霍', u'霎', u'辙', u'冀', u'踱', u'蹂', u'蟆', 
	u'螃', u'螟', u'噪', u'鹦', u'黔', u'穆', u'篡', u'篷', u'篙', u'篱', u'儒', u'膳', u'鲸', u'瘾', u'瘸', u'糙', u'燎', u'濒', u'憾', u'懈', 
	u'窿', u'缰', 
]

# 十七画 （共32字）
secondary_chars_17 = [
	u'壕', u'藐', u'檬', u'檐', u'檩', u'檀', u'礁', u'磷', u'瞭', u'瞬', u'瞳', u'瞪', u'曙', u'蹋', u'蟋', u'蟀', u'嚎', u'赡', u'镣', u'魏', 
	u'簇', u'儡', u'徽', u'爵', u'朦', u'臊', u'鳄', u'糜', u'癌', u'懦', u'豁', u'臀', 
]

# 十八画 （共10字
secondary_chars_18 = [
	u'藕', u'藤', u'瞻', u'嚣', u'鳍', u'癞', u'瀑', u'襟', u'璧', u'戳', 
]

# 十九画 （共13字）
secondary_chars_19 = [
	u'攒', u'孽', u'蘑', u'藻', u'鳖', u'蹭', u'蹬', u'簸', u'簿', u'蟹', u'靡', u'癣', u'羹',
]

# 二十画 （共7字）
secondary_chars_20 = [
	u'鬓', u'攘', u'蠕', u'巍', u'鳞', u'糯', u'譬',
]

# 二十一画 （共3字）
secondary_chars_21 = [
	u'霹', u'躏', u'髓',
]

# 二十二画 （共3字）
secondary_chars_22 = [
	u'蘸', u'镶', u'瓤',
]

# 二十四画 （共1字）
secondary_chars_24 = [
	u'矗',
]


primary_chars = []
for i in primary_chars_index:
	primary_chars = primary_chars + eval('primary_chars_%s' % i)


secondary_chars = []
for i in secondary_chars_index:
	secondary_chars = secondary_chars + eval('secondary_chars_%s' % i)

